In [1]:
import pandas as pd

In [2]:
sous_nutrition = pd.read_csv(r"C:\Users\Asus\OneDrive\Bureau\CSV Projet 4\sous_nutrition.csv", sep=';')

In [3]:
sous_nutrition

             Zone      Année  Valeur
0     Afghanistan  2012-2014     8.6
1     Afghanistan  2013-2015     8.8
2     Afghanistan  2014-2016     8.9
3     Afghanistan  2015-2017     9.7
4     Afghanistan  2016-2018    10.5
...           ...        ...     ...
1213     Zimbabwe  2013-2015     NaN
1214     Zimbabwe  2014-2016     NaN
1215     Zimbabwe  2015-2017     NaN
1216     Zimbabwe  2016-2018     NaN
1217     Zimbabwe  2017-2019     NaN

[1218 rows x 3 columns]

In [4]:
dimensions = sous_nutrition.shape
nombre_lignes = dimensions[0]
nombre_colonnes = dimensions[1]

In [5]:
print("Dimensions du dataset : {} lignes, {} colonnes".format(nombre_lignes, nombre_colonnes))

Dimensions du dataset : 1218 lignes, 3 colonnes

In [6]:
sous_nutrition.head()

          Zone      Année  Valeur
0  Afghanistan  2012-2014     8.6
1  Afghanistan  2013-2015     8.8
2  Afghanistan  2014-2016     8.9
3  Afghanistan  2015-2017     9.7
4  Afghanistan  2016-2018    10.5

In [7]:
sous_nutrition['Valeur'] = pd.to_numeric(sous_nutrition['Valeur'])

In [8]:
sous_nutrition.head()

          Zone      Année  Valeur
0  Afghanistan  2012-2014     8.6
1  Afghanistan  2013-2015     8.8
2  Afghanistan  2014-2016     8.9
3  Afghanistan  2015-2017     9.7
4  Afghanistan  2016-2018    10.5

In [9]:
sous_nutrition['Valeur'] = pd.to_numeric(sous_nutrition['Valeur'], errors='coerce')

In [10]:
sous_nutrition

             Zone      Année  Valeur
0     Afghanistan  2012-2014     8.6
1     Afghanistan  2013-2015     8.8
2     Afghanistan  2014-2016     8.9
3     Afghanistan  2015-2017     9.7
4     Afghanistan  2016-2018    10.5
...           ...        ...     ...
1213     Zimbabwe  2013-2015     NaN
1214     Zimbabwe  2014-2016     NaN
1215     Zimbabwe  2015-2017     NaN
1216     Zimbabwe  2016-2018     NaN
1217     Zimbabwe  2017-2019     NaN

[1218 rows x 3 columns]

In [11]:
donnees_sans_nan = sous_nutrition.fillna(0)

In [12]:
sous_nutrition.fillna(0, inplace=True)

In [13]:
sous_nutrition

             Zone      Année  Valeur
0     Afghanistan  2012-2014     8.6
1     Afghanistan  2013-2015     8.8
2     Afghanistan  2014-2016     8.9
3     Afghanistan  2015-2017     9.7
4     Afghanistan  2016-2018    10.5
...           ...        ...     ...
1213     Zimbabwe  2013-2015     0.0
1214     Zimbabwe  2014-2016     0.0
1215     Zimbabwe  2015-2017     0.0
1216     Zimbabwe  2016-2018     0.0
1217     Zimbabwe  2017-2019     0.0

[1218 rows x 3 columns]

In [14]:
sous_nutrition = sous_nutrition.rename(columns={'Valeur': 'sous_nutrition'})
sous_nutrition.head()

          Zone      Année  sous_nutrition
0  Afghanistan  2012-2014             8.6
1  Afghanistan  2013-2015             8.8
2  Afghanistan  2014-2016             8.9
3  Afghanistan  2015-2017             9.7
4  Afghanistan  2016-2018            10.5

In [15]:
sous_nutrition['sous_nutrition'] = sous_nutrition['sous_nutrition'] * 1000000

In [17]:
sous_nutrition.head()

          Zone      Année  sous_nutrition
0  Afghanistan  2012-2014       8600000.0
1  Afghanistan  2013-2015       8800000.0
2  Afghanistan  2014-2016       8900000.0
3  Afghanistan  2015-2017       9700000.0
4  Afghanistan  2016-2018      10500000.0

In [18]:
sous_nutrition.iloc[:5, [] + list(range(0, 3))]

          Zone      Année  sous_nutrition
0  Afghanistan  2012-2014       8600000.0
1  Afghanistan  2013-2015       8800000.0
2  Afghanistan  2014-2016       8900000.0
3  Afghanistan  2015-2017       9700000.0
4  Afghanistan  2016-2018      10500000.0

In [19]:
import pandas as pd

In [20]:
population = pd.read_csv(r"C:\Users\Asus\OneDrive\Bureau\CSV Projet 4\population.csv", sep=';')

In [21]:
population = population.rename(columns={'Valeur': 'population'})

In [22]:
population.head()

          Zone Année  population
0  Afghanistan  2013   32269.589
1  Afghanistan  2014   33370.794
2  Afghanistan  2015   34413.603
3  Afghanistan  2016   35383.032
4  Afghanistan  2017   36296.113

In [23]:
df_merged = pd.merge(population, sous_nutrition, on='Année', how='left')

In [24]:
df_merged

           Zone_x Année  population Zone_y  sous_nutrition
0     Afghanistan  2013   32269.589    NaN             NaN
1     Afghanistan  2014   33370.794    NaN             NaN
2     Afghanistan  2015   34413.603    NaN             NaN
3     Afghanistan  2016   35383.032    NaN             NaN
4     Afghanistan  2017   36296.113    NaN             NaN
...           ...   ...         ...    ...             ...
1411     Zimbabwe  2014   13586.707    NaN             NaN
1412     Zimbabwe  2015   13814.629    NaN             NaN
1413     Zimbabwe  2016   14030.331    NaN             NaN
1414     Zimbabwe  2017   14236.595    NaN             NaN
1415     Zimbabwe  2018   14438.802    NaN             NaN

[1416 rows x 5 columns]

In [25]:
population_2017 = population.query('Année == 2017')

In [26]:
sous_nutrition_2017 = sous_nutrition.query('Année == 2017')

In [27]:
df_merged_2017 = pd.merge(population_2017, sous_nutrition_2017, on='Année', how='left')

In [28]:
population = pd.DataFrame({
    'Zone_x': ['Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe'],
    'Année': [2013, 2014, 2015, 2016, 2017, 2014, 2015, 2016, 2017, 2018],
    'population': [32269.589, 33370.794, 34413.603, 35383.032, 36296.113, 13586.707, 13814.629, 14030.331, 14236.595, 14438.802]
})

In [29]:
sous_nutrition = pd.DataFrame({
    'Zone_y': ['Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe'],
    'Année': [2013, 2014, 2015, 2016, 2017, 2014, 2015, 2016, 2017, 2018],
    'sous_nutrition': [30.0, 29.0, 28.0, 27.0, 26.0, 15.0, 14.5, 14.0, 13.5, 13.0]  
})

In [30]:
print(population.dtypes)

Zone_x         object
Année           int64
population    float64
dtype: object

In [31]:
print(sous_nutrition.dtypes)

Zone_y             object
Année               int64
sous_nutrition    float64
dtype: object

In [32]:
population['Année'] = population['Année'].astype(int)

In [33]:
sous_nutrition['Année'] = sous_nutrition['Année'].astype(int)

In [34]:
population_2017 = population[population['Année'] == 2017]

In [35]:
sous_nutrition_2017 = sous_nutrition[sous_nutrition['Année'] == 2017]

In [36]:
print(population_2017)

        Zone_x  Année  population
4  Afghanistan   2017   36296.113
8     Zimbabwe   2017   14236.595

In [37]:
df_merged_2017['Population_sous_nutrition'] = df_merged_2017['population'] * (df_merged_2017['sous_nutrition'] / 100)
total_sous_nutrition = df_merged_2017['Population_sous_nutrition'].sum()

In [38]:
print(f"\nNombre total de personnes en état de sous-nutrition en 2017 : {total_sous_nutrition}")

Nombre total de personnes en état de sous-nutrition en 2017 : 0.0

In [39]:
dimensions = population_2017.shape
nombre_lignes = dimensions[0]
nombre_colonnes = dimensions[1]

In [40]:
print("Dimensions du dataset : {} lignes, {} colonnes".format(nombre_lignes, nombre_colonnes))

Dimensions du dataset : 2 lignes, 3 colonnes